cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF51xN.xml
        <!-- REGISTER "WTBR" -->
        <register>
          <name>WTBR</name>
          <description>Counter Cycle Setting Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BR23" -->
            <field>
              <name>BR23</name>
              <description>Bit23 of WTBR</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR22" -->
            <field>
              <name>BR22</name>
              <description>Bit22 of WTBR</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR21" -->
            <field>
              <name>BR21</name>
              <description>Bit21 of WTBR</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR20" -->
            <field>
              <name>BR20</name>
              <description>Bit20 of WTBR</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR19" -->
            <field>
              <name>BR19</name>
              <description>Bit19 of WTBR</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR18" -->
            <field>
              <name>BR18</name>
              <description>Bit18 of WTBR</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR17" -->
            <field>
              <name>BR17</name>
              <description>Bit17 of WTBR</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR16" -->
            <field>
              <name>BR16</name>
              <description>Bit16 of WTBR</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR15" -->
            <field>
              <name>BR15</name>
              <description>Bit15 of WTBR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR14" -->
            <field>
              <name>BR14</name>
              <description>Bit14 of WTBR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR13" -->
            <field>
              <name>BR13</name>
              <description>Bit13 of WTBR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR12" -->
            <field>
              <name>BR12</name>
              <description>Bit12 of WTBR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR11" -->
            <field>
              <name>BR11</name>
              <description>Bit11 of WTBR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR10" -->
            <field>
              <name>BR10</name>
              <description>Bit10 of WTBR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR9" -->
            <field>
              <name>BR9</name>
              <description>Bit9 of WTBR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR8" -->
            <field>
              <name>BR8</name>
              <description>Bit8 of WTBR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR7" -->
            <field>
              <name>BR7</name>
              <description>Bit7 of WTBR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR6" -->
            <field>
              <name>BR6</name>
              <description>Bit6 of WTBR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR5" -->
            <field>
              <name>BR5</name>
              <description>Bit5 of WTBR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR4" -->
            <field>
              <name>BR4</name>
              <description>Bit4 of WTBR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR3" -->
            <field>
              <name>BR3</name>
              <description>Bit3 of WTBR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR2" -->
            <field>
              <name>BR2</name>
              <description>Bit2 of WTBR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR1" -->
            <field>
              <name>BR1</name>
              <description>Bit1 of WTBR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BR0" -->
            <field>
              <name>BR0</name>
              <description>Bit0 of WTBR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTDR" -->
        <register>
          <name>WTDR</name>
          <description>Date Register</description>
          <addressOffset>0xF</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TD" -->
            <field>
              <name>TD</name>
              <description>the second digit of the date</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "D" -->
            <field>
              <name>D</name>
              <description>the first digit of the date</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTHR" -->
        <register>
          <name>WTHR</name>
          <description>Hour register</description>
          <addressOffset>0xE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TH" -->
            <field>
              <name>TH</name>
              <description>the second digit of the hour</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "H" -->
            <field>
              <name>H</name>
              <description>the first digit of the hour</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTMIR" -->
        <register>
          <name>WTMIR</name>
          <description>Minute Register</description>
          <addressOffset>0xD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMI" -->
            <field>
              <name>TMI</name>
              <description>the second digit of the minute</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MI" -->
            <field>
              <name>MI</name>
              <description>the first digit of the minute</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTSR" -->
        <register>
          <name>WTSR</name>
          <description>Second Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS" -->
            <field>
              <name>TS</name>
              <description>the second digit of the second</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S" -->
            <field>
              <name>S</name>
              <description>the first digit of the second</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
